app/Controllers/Home.php

SELECT *
FROM `user`
WHERE `username` = 'admin'
AND `password` = '123'
 LIMIT 1
---
    public function userLogin(){

        if($this->request->getMethod() == "post"){
            $username = $this->request->getVar("username");
            $password = $this->request->getVar("password");

            $queryUser = $this->userModel->where("username", $username)->where("password", $password)->first();